Show / Hide Table of Contents
Class ResultOfNLA2
Result of internal forces in the one position
Inheritance
System.Object
ResultOfLoading2
ResultOfNLA2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLA2 : ResultOfLoading2
Constructors
Improve this Doc   View Source
ResultOfNLA2()
Constructor
Declaration
public ResultOfNLA2()
Properties
Improve this Doc   View Source
Points
Results in section
Declaration
public List<ResultOfNLAPoint> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfNLAPoint>
 Improve this Doc
 View Source